[
  "It is a myth that dogs are color blind. They can actually see in color, just not as vividly as humans. It is similar to our vision at dusk.",
  "Dogs DO have better low-light vision than humans because of a special light-reflecting layer behind their retinas.",
  "A German Shepherd guide dog led her blind companion through the entire 2100-mile Appalachian Trail.",
  "If never spayed or neutered, a female dog, her mate, and their puppies could produce over 66,000 dogs in 6 years!",
  "A dog's' only sweat glands are between their paw pads.",
  "Like human babies, Chihuahuas are born with a soft spot in their skull which closes with age.",
  "The Lundehune breed has 6 toes and can close its ears.",
  "Teddy Roosevelt's dog, Pete, ripped a French Ambassador's pants off at the White House.",
  "President Lyndon Johnson had two beagles named Him and Her.",
  "Franklin Roosevelt spent $15,000 for a destroyer to pick up his Scottie in the Aleutian Islands.",
  "In Roman times, mastiffs donned light armor and were sent after mounted knights.",
  "The Russians trained dogs during WWII to run suicide missions with mines strapped to their backs.",
  "A dog's mouth exerts 150-200 pounds of pressure per square inch. Some dog breeds can exert up to 450 pounds per square inch.",
  "A one year old dog is as mature, physically, as a 15-year old human.",
  "The U.S. has the highest dog population in the world. France has the 2nd highest dog population.",
  "The average city dog lives 3 years longer than a country dog.",
  "87% of dog owners say their dog curls up beside them or at their feet while they watch TV",
  "Dogs can be trained to detect epileptic seizures.",
  "15 people die in the U.S. every year from dog bites.",
  "In 2002, more people in the U.S. were killed by dogs than by sharks during the past 100 years.",
  "Gidget is the name of the Taco Bell dog.",
  "Newfoundlands are great swimmers because of their webbed feet.",
  "Basset Hounds cannot swim.",
  "Greyhounds are the fastest dogs on earth, with speeds of up to 45 miles per hour.",
  "Bingo is the name of the dog on the side of the Cracker Jack box.",
  "The Bible mentions dogs 14 times.",
  "Three dogs survived the sinking of the Titanic - a Newfoundland, a Pomeranian, and a Pekingese.",
  "The Labrador Retriever is the #1 favorite breed in the U.S., Canada, and the United Kingdom.",
  "Obesity is the #1 health problem among dogs.",
  "An estimated 1,000,000 dogs in the U.S. have been named as the primary beneficiaries in their owner's will.",
  "An American Animal Hospital Association. poll found that 33% of dog owners admit to talking to their dogs on the phone and leaving answering machine messages for them while away.",
  "A dog's nose prints are as unique as a human's fingerprints and can be used to accurately identify them.",
  "At the end of the Beatles' song \"A Day in the Life\", a high-pitched dog whistle was recorded by Paul McCartney for his sheepdog.",
  "70% of people sign their pet's name on greeting and holiday cards.",
  "58% of people put pets in family and holiday portraits.",
  "There are only 350 Cisky Terriers in the world - perhaps the rarest breed.",
  "The phrase \"raining cats and dogs\" originated in 17th century England when it is believed that many cats and dogs drowned during heavy periods of rain.",
  "Dogs have no sense of \"time\".",
  "Humans have kept dogs as pets for over 12,000 years.",
  "The largest breed of dog is the Irish Wolfhound.",
  "The world's smallest dog breed is the Chihuahua.",
  "The St. Bernard is the world's heaviest breed.",
  "Only dogs and humans have prostates.",
  "Dogs do not have an appendix.",
  "Every dog on earth likely descended from a species known as the Tomarctus - a creature that roamed the earth over 15 million years ago.",
  "The oldest known dog breed is most likely the Saluki - originally trained by Egyptians to help them track game.",
  "In 1957, Laika became the first living being in space via an earth satellite.",
  "JFK's terrier, Charlie, fathered 4 puppies with Laika's daughter.",
  "An African wolf dog known as the Basenji is the only dog in the world that cannot bark.",
  "There are 703 breeds of purebred dogs."
]